cmsis-svd/cmsis-svd/data/GigaDevice/GD32F3x0.svd
      </registers>
    </peripheral>
   <peripheral>
      <name>CTC</name>
      <description>Clock trim controller</description>
      <groupName>CTC</groupName>
      <baseAddress>0x4000C800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTL0</name>
          <displayName>CTL0</displayName>
          <description>Control Register 0 </description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00002000</resetValue>
          <fields>
            <field>
              <name>TRIMVALUE</name>
              <description>IRC48M trim value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>SWREFPUL</name>
              <description>Software reference source sync pulse</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AUTOTRIM</name>
              <description>Hardware automatically trim mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CNTEN</name>
              <description>CTC counter enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EREFIE</name>
              <description>EREFIF interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRIE</name>
              <description>Error (ERRIF) interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKWARNIE</name>
              <description>Clock trim warning (CKWARNIF) interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKOKIE</name>
              <description>Clock trim OK (CKOKIF) interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL1</name>
          <displayName>CTL1</displayName>
          <description>Control Register 1</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x2022BB7F</resetValue>
          <fields>
            <field>
              <name>RLVALUE</name>
              <description>CTC counter reload value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>CKLIM</name>
              <description>Clock trim base limit value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
             </field>
            <field>
              <name>REFPSC</name>
              <description>Reference signal source prescaler</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
             </field>
            <field>
              <name>REFSEL</name>
              <description>Reference signal source selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
             </field>
            <field>
              <name>REFPOL</name>
              <description>Reference signal source polarity</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <displayName>STAT</displayName>
          <description>Status Register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CKOKIF</name>
              <description>Clock trim OK interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKWARNIF</name>
              <description>Clock trim warning interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
             </field>
            <field>
              <name>ERRIF</name>
              <description>Error interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
             </field>
            <field>
              <name>EREFIF</name>
              <description>Expect reference interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
             </field> 
            <field>
              <name>CKERR</name>
              <description>Clock trim error bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
             </field>  
            <field>
              <name>REFMISS</name>
              <description>Reference sync pulse miss</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
             </field>  
            <field>
              <name>TRIMERR</name>
              <description>Trim value error bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
             </field>  
            <field>
              <name>REFDIR</name>
              <description>CTC trim counter direction when reference sync pulse</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
             </field>  
            <field>
              <name>REFCAP</name>
              <description>CTC counter capture when reference sync pulse</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
             </field>             
          </fields>
        </register>
        <register>
          <name>INTC</name>
          <displayName>INTC</displayName>
          <description>Interrupt clear Register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CKOKIC</name>
              <description>CKOKIF interrupt clear bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKWARNIC</name>
              <description>CKWARNIF interrupt clear bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
             </field>
            <field>
              <name>ERRIC</name>
              <description>ERRIF interrupt clear bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
             </field>
            <field>
              <name>EREFIC</name>
              <description>EREFIF interrupt clear bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
             </field>           
          </fields>
        </register>
